CSI API ETABS v1

# cSapModelDiaphragm Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDiaphragm Diaphragm { get; }

    ReadOnly Property Diaphragm As cDiaphragm
    	Get

    Dim instance As cSapModel
    Dim value As cDiaphragm

    value = instance.Diaphragm

    property cDiaphragm^ Diaphragm {
    	cDiaphragm^ get ();
    }

    abstract Diaphragm : cDiaphragm with get

#### Property Value

Type: cDiaphragm

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com